In [1]:
import pandas as pd

In [2]:
sf= pd.read_csv("C:\\Users\Windows\_ANCONDA WORKSHOP\datasets\SF salaries.csv")

C:\Users\Windows\Anaconda3\lib\site-packages\IPython\core\interactiveshell.py:3057: DtypeWarning: Columns (3,4,5,6,12) have mixed types. Specify dtype option on import or set low_memory=False.
  interactivity=interactivity, compiler=compiler, result=result)

In [4]:
sf.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 148654 entries, 0 to 148653
Data columns (total 13 columns):
Id                  148654 non-null int64
EmployeeName        148654 non-null object
JobTitle            148654 non-null object
BasePay             148049 non-null object
OvertimePay         148654 non-null object
OtherPay            148654 non-null object
Benefits            112495 non-null object
TotalPay            148654 non-null float64
TotalPayBenefits    148654 non-null float64
Year                148654 non-null int64
Notes               0 non-null float64
Agency              148654 non-null object
Status              38119 non-null object
dtypes: float64(3), int64(2), object(8)
memory usage: 14.7+ MB

In [54]:
pd.value_counts(sf['BasePay'].isna())
sf['BasePay'].dropna(inplace=True)
sf['BasePay']=sf['BasePay'].astype(float)
sf['BasePay'].mean()

66325.44884050643

In [60]:
sf[sf['EmployeeName']=='JOSEPH DRISCOLL']['JobTitle']

24    CAPTAIN, FIRE SUPPRESSION
Name: JobTitle, dtype: object

In [62]:
sf[sf['EmployeeName']=='JOSEPH DRISCOLL']['TotalPayBenefits']

24    270324.91
Name: TotalPayBenefits, dtype: float64

In [67]:
sf['TotalPayBenefits'].max()

567595.43

In [76]:
sf[sf['TotalPayBenefits']==sf['TotalPayBenefits'].max()]

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0,400184,NaN,567595.43,567595.43,2011,NaN,San Francisco,NaN

In [75]:
sf[sf['TotalPayBenefits']==sf['TotalPayBenefits'].min()]

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
148653,148654,Joe Lopez,"Counselor, Log Cabin Ranch",0.0,0,-618.13,0,-618.13,-618.13,2014,NaN,San Francisco,PT

In [77]:
sf.head(1)

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0,400184,NaN,567595.43,567595.43,2011,NaN,San Francisco,NaN

In [78]:
pd.value_counts(sf['Year'])

2014    38119
2013    37606
2012    36766
2011    36159
Name: Year, dtype: int64

In [84]:
sf.groupby('Year').mean()['BasePay']

Year
2011    63595.956517
2012    65436.406857
2013    69630.030216
2014    66564.421924
Name: BasePay, dtype: float64

In [87]:
sf['JobTitle'].nunique()

2158

In [103]:
sum(sf[sf['Year']==2013]['JobTitle'].value_counts()==1)

202

In [113]:
chief=sf['JobTitle']
count=0
for i in chief:
    if 'Chief' in i or 'CHIEF' in i:
        count+=1
count

627

'Counselor, Log Cabin Ranch'

In [126]:
type(pd.value_counts(sf['JobTitle']))

pandas.core.series.Series

In [128]:
sf['title_length']=sf['EmployeeName'].apply(len)

In [130]:
sf[['title_length','TotalPayBenefits']].corr()

                  title_length  TotalPayBenefits
title_length          1.000000         -0.001141
TotalPayBenefits     -0.001141          1.000000

In [116]:
sf.head()

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0,400184,NaN,567595.43,567595.43,2011,NaN,San Francisco,NaN
1,2,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),155966.02,245132,137811,NaN,538909.28,538909.28,2011,NaN,San Francisco,NaN
2,3,ALBERT PARDINI,CAPTAIN III (POLICE DEPARTMENT),212739.13,106088,16452.6,NaN,335279.91,335279.91,2011,NaN,San Francisco,NaN
3,4,CHRISTOPHER CHONG,WIRE ROPE CABLE MAINTENANCE MECHANIC,77916.00,56120.7,198307,NaN,332343.61,332343.61,2011,NaN,San Francisco,NaN
4,5,PATRICK GARDNER,"DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)",134401.60,9737,182235,NaN,326373.19,326373.19,2011,NaN,San Francisco,NaN